#+TITLE: Berezhnev's GNU Emacs config
#+AUTHOR: Berezhnev Vladimir (Tell396)
#+DESCRIPTION: Berezhnev's personal Emacs config.

I don't want to use init.el to config Emacs.  I want to use an org file to config Emacs because I like literate configs with lots of comments.  The following code block should be your init.el.  This tells init.el to use the source code blocks from this file (README.org).

** Window
#+begin_src emacs-lisp
  (eval-when-compile (defvar display-time-24hr-format t))
  (eval-when-compile (defvar display-time-default-load-average nil))

  (display-battery-mode t)		  ;; Show battery.
  (display-time-mode t)			  ;; Show time.
  (set-fringe-mode 1)               ;; Give us some space.
  (delete-selection-mode nil)		  ;; Use a more sane delete mode than evil.
  (fset 'yes-or-no-p 'y-or-n-p)     ;; Set yes or no to y/n
  (global-font-lock-mode 1)         ;; always highlight code
  (global-auto-revert-mode 1)       ;; refresh a buffer if changed on disk
  ;; (global-hl-line-mode 1)           ;; Highlight current line
  ;; (semantic-mode 1)								;; help out with semantics
  (savehist-mode 1)                 ;; Save history
  (save-place-mode 1)               ;; when buffer is closed, save the cursor position
  (blink-cursor-mode 1)

  ;; Setup fonts
  (set-face-attribute 'default nil :font "JetBrainsMono Nerd Font Mono" :height 130)
  (set-face-attribute 'fixed-pitch nil :font "JetBrainsMono Nerd Font Mono")
  ;;(set-face-attribute 'variable-pitch nil :font "Iosevka Aile" :height 150)
  (variable-pitch-mode t)

  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (setq-default shell-file-name "/usr/bin/fish")

  (setq ad-redefinition-action            'accept
        default-buffer-file-coding-system 'utf-8
        blink-cursor-interval             0.6       ;; Little slower cursor blinking . default is 0.5
        create-lockfiles                  nil
        idle-update-delay                 1.2    ;; Speed things up by not updating so often
        read-process-output-max           (* 8 1024 1024)
        ediff-split-window-function       'split-window-horizontally
        highlight-nonselected-windows     t
        auto-mode-case-fold               nil
        backup-by-copying                 t
        byte-compile-warnings             '(ck-functions)
        confirm-kill-processes            nil
        fast-but-imprecise-scrolling      t
        jit-lock-defer-time               0.0
        echo-keystrokes                   0.2
        kill-buffer-query-functions       nil    ;; Dont ask for closing spawned processes
        line-number-mode                  nil
        use-dialog-box                    nil
        load-prefer-newer                 t
        word-wrap                         nil
        visible-bell                      nil
        bidi-display-reordering           nil
        large-file-warning-threshold nil      ;; Disable "File is large. Really open?"
        x-stretch-cursor                  t   ;; stretch cursor on tabs
        scroll-margin                     4   ;; scroll N to screen edge
        undo-limit                        6710886400 ;; 64mb
        undo-strong-limit                 100663296 ;; x 1.5 (96mb)
        undo-outer-limit                  1006632960) ;; x 10 (960mb), (Emacs uses x100), but this seems too high.
#+end_src

#+RESULTS:
: 1006632960

*** Org bullets
#+begin_src emacs-lisp
  ;; (use-package org-superstar
  ;; 	:ensure t
  ;; 	:config
  ;; 	(setq org-superstar-headline-bullets-list '("◉" "⬢" "○" "✸" "✿")))
  ;; (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))

  ;; (use-package org-bullets
  ;; 	:ensure t
  ;; 	:hook (org-mode . org-bullets-mode)
  ;; 	:custom
  ;; 	(org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

  (use-package org-bullets
    :ensure t
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "✿" "✚" "✸" "❀" "○"))) ; "●" "▷" "🞛" "◈" "✖"
#+end_src

#+RESULTS:
| (lambda nil (set (make-local-variable 'company-backends) '(company-org-block)) (company-mode 1)) | (lambda nil (display-line-numbers-mode 0)) | (closure (org-agenda-skip-regexp org-fold-core-style org-table1-hline-regexp org-table-tab-recognizes-table.el org-table-dataline-regexp org-table-any-border-regexp org-agenda-restriction-lock-overlay org-agenda-overriding-restriction org-agenda-diary-file org-complex-heading-regexp calendar-mode-map t) nil (setq imenu-create-index-function 'org-imenu-get-tree)) | org-toggle-latex-fragment | org-ref-org-menu | org-fancy-priorities-mode | org-bullets-mode | org-tempo-setup | (closure (org--rds reftex-docstruct-symbol org--single-lines-list-is-paragraph org-element-greater-elements visual-fill-column-width org-clock-history org-agenda-current-date org-with-time org-defdecode org-def org-read-date-inactive org-ans2 org-ans1 org-columns-current-fmt-compiled org-clock-current-task org-clock-effort org-agenda-skip-function org-agenda-skip-comment-trees org-agenda-archives-mode org-end-time-was-given org-time-was-given org-log-note-extra org-log-note-purpose org-log-post-message org-last-inserted-timestamp org-last-changed-timestamp org-entry-property-inherited-from org-blocked-by-checkboxes org-state org-agenda-headline-snapshot-before-repeat org-agenda-buffer-name org-agenda-start-on-weekday org-agenda-buffer-tmp-name org-priority-regexp org-mode-abbrev-table org-mode-syntax-table org-element-cache-persistent buffer-face-mode-face org-tbl-menu org-org-menu org-struct-menu org-entities org-last-state org-id-track-globally org-clock-start-time texmathp-why remember-data-file org-agenda-tags-todo-honor-ignore-options calc-embedded-open-mode calc-embedded-open-formula calc-embedded-close-formula align-mode-rules-list org-emphasis-alist org-emphasis-regexp-components org-export-registered-backends org-modules crm-separator org-babel-load-languages org-id-overriding-file-name org-indent-indentation-per-level org-element--timestamp-regexp org-element-cache-map-continue-from org-element-paragraph-separate org-agenda-buffer-name org-inlinetask-min-level t) nil (add-hook 'change-major-mode-hook 'org-fold-show-all 'append 'local)) | (closure (org-src-window-setup *this* org-babel-confirm-evaluate-answer-no org-babel-tangle-uncomment-comments org-src-preserve-indentation org-src-lang-modes org-edit-src-content-indentation org-babel-library-of-babel t) nil (add-hook 'change-major-mode-hook #'org-babel-show-result-all 'append 'local)) | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** Doom modeline
#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :hook
    (after-init . doom-modeline-mode)
    (doom-modeline-mode . display-battery-mode)
    :custom
    (setq doom-modeline-buffer-encoding nil
          ;; doom-modeline-buffer-file-name-style 'file-name
          doom-modeline-checker-simple-format t
          doom-modeline-vcs-max-length 50
          doom-modeline-major-mode-icon nil
          doom-modeline-icon t
          doom-modeline-modal-icon t
          doom-modeline-lsp nil
          doom-modeline-major-mode-color-icon nil
          doom-modeline-buffer-state-icon nil
          doom-modeline-time-icon nil)
    (custom-set-faces
     '(mode-line ((t (:family "Iosevka Aile" :height 1.0))))
     '(mode-line-active ((t (:family "Iosevka Aile" :height 1.0)))) ; For 29+
     '(mode-line-inactive ((t (:family "Iosevka Aile" :height 0.95)))))
    (doom-modeline-buffer-file-name-style 'relative-from-project)
    )

  ;; (use-package doom-modeline
  ;; 	:ensure t
  ;; 	:defer t
  ;; 	:custom
  ;; 	(doom-modeline-modal-icon nil)
  ;; 	(doom-modeline-buffer-file-name-style 'relative-from-project)
  ;; 	:hook
  ;; 	(after-init . doom-modeline-mode)
  ;; 	(doom-modeline-mode . display-battery-mode))

#+end_src

#+RESULTS:
| display-battery-mode | doom-modeline-override-time | doom-modeline-override-battery | doom-modeline-override-rcirc | doom-modeline-override-mu4e-alert | doom-modeline-override-eglot |

** Setting Company
#+begin_src emacs-lisp
  ;; Install company
  ;; (use-package company
  ;; 	:ensure t
  ;; 	:defer 20
  ;; 	;; This is not perfect yet. It completes too quickly outside programming modes, but while programming it is just right.
  ;; 	:custom
  ;; 	(company-idle-delay 0.1)
  ;; 	(global-company-mode t)
  ;; 	(debug-on-error nil) ;; otherwise this throws lots of errors on completion errors
  ;; 	:config
  ;; 	(define-key company-active-map (kbd "TAB") 'company-complete-selection)
  ;; 	(define-key company-active-map (kbd "<tab>") 'company-complete-selection)
  ;; 	(define-key company-active-map [return] 'company-complete-selection)
  ;; 	(define-key company-active-map (kbd "RET") 'company-complete-selection)

  ;; 	(setq company-transformers '(company-sort-by-backend-importance)
  ;; 				company-format-margin-function  'company-vscode-dark-icons-margin
  ;; 				company-tooltip-margin              0
  ;; 				company-dabbrev-downcase            nil
  ;; 				company-dabbrev-ignore-case         t
  ;; 				company-dabbrev-other-buffers       'all
  ;; 				company-minimum-prefix-length       1
  ;; 				company-tooltip-align-annotations   t
  ;; 				company-require-match               nil
  ;; 				company-tooltip-limit               25
  ;; 				company-tooltip-width-grow-only     nil
  ;; 				company-tooltip-flip-when-above     t
  ;; 				company-show-quick-access           'left
  ;; 				company-async-wait                  0.1
  ;; 				company-async-timeout               1
  ;; 				company-idle-delay                  0.1
  ;; 				company-frontends '(company-box-frontend))


  ;; (defun my-company-visible-and-explicit-action-p ()
  ;;   (and (company-tooltip-visible-p)
  ;;        (company-explicit-action-p)))
  ;; (defun company-ac-setup ()
  ;;   "Sets up `company-mode' to behave similarly to `auto-complete-mode'."
  ;;   (setq company-require-match nil)
  ;;   (setq company-auto-complete 'my-company-visible-and-explicit-action-p)
  ;;   (setq company-frontends '(company-echo-metadata-frontend
  ;;                             company-pseudo-tooltip-unless-just-one-frontend-with-delay
  ;;                             company-preview-frontend))
  ;;   (define-key company-active-map [tab]
  ;;     'company-select-next-if-tooltip-visible-or-complete-selection)
  ;;   (define-key company-active-map (kbd "TAB")
  ;;     'company-select-next-if-tooltip-visible-or-complete-selection))

  ;; (company-ac-setup)
  ;; (add-hook 'js2-mode-hook (lambda () (company-mode)))

  ;; (use-package company
  ;;   :defer t
  ;;   :hook (prog-mode . company-mode)
  ;;   :bind
  ;;   (:map company-active-map
  ;;         ("RET" . company-complete-selection)
  ;;         ("<return>" . company-complete-selection)
  ;;         ("<tab>" . company-complete-selection))
  ;;   :config
  ;;   (setq company-transformers '(company-sort-by-backend-importance)
  ;;         company-format-margin-function  'company-vscode-dark-icons-margin
  ;;         company-tooltip-margin              0
  ;;         company-dabbrev-downcase            nil
  ;;         company-dabbrev-ignore-case         t
  ;;         company-dabbrev-other-buffers       'all
  ;;         company-minimum-prefix-length       1
  ;;         company-tooltip-align-annotations   t
  ;;         company-require-match               nil
  ;;         company-tooltip-limit               25
  ;;         company-tooltip-width-grow-only     nil
  ;;         company-tooltip-flip-when-above     t
  ;;         company-show-quick-access           'left
  ;;         company-async-wait                  0.1
  ;;         company-async-timeout               1
  ;;         ;; company-frontends '(company-box-frontend)
  ;;         company-idle-delay                  0.1)
  ;;   (push '(company-semantic :with company-yasnippet) company-backends))

  ;; (use-package company-box
  ;;   :ensure t
  ;;   :after (company all-the-icons)
  ;;   :hook (company-mode . company-box-mode)
  ;;   :functions (all-the-icons-faicon
  ;;               all-the-icons-material
  ;;               all-the-icons-octicon
  ;;               all-the-icons-alltheicon)
  ;;   :config
  ;;   (setq company-box-frame-behavior 'point
  ;;         company-box-icons-alist 'company-box-icons-images
  ;;         company-box-backends-colors t
  ;;         company-box-icon-right-margin 0.5
  ;;         company-box-backends-colors '((company-yasnippet
  ;;                                        :all (:foreground "RosyBrown1" :background nil :italic t)
  ;;                                        :selected (:foreground "black" :background "RosyBrown4")))
  ;;         company-box-doc-delay 1))

  ;; (defun setup-swift-mode-company ()
  ;; 	"Setup company with separate bakends merged into one."
  ;; 	(setq-local company-backends
  ;; 							'((company-capf :with company-dabbrev-code company-yasnippet ))))

  (use-package company-quickhelp
    :ensure t
    :hook (company-mode . company-quickhelp-mode))

  (use-package company-statistics
    :ensure t
    :hook (company-mode . company-statistics-mode))


  (use-package company-anaconda
    :ensure t
    :defer
    :after company
    :config (add-to-list 'company-backends 'company-anaconda))

  ;; Company mode Show
  (setq company-idle-delay 0)
  (setq company-minimum-prefix-length 1)
#+end_src

#+RESULTS:
: 1

